Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
    // System commands ($H, $X, etc.)
    if (cmd[0] == '$') {
        if (cmd[1] == 'H' && (cmd[2] == '\0' || cmd[2] == '\n' || cmd[2] == '\r')) {
            // $H - Home all axes command
            ev->type = GCODE_EVENT_HOMING;
            ev->data.homing.axes_mask = 0x0F; // Home all axes (XYZA = bits 0-3)
            return true;
        }
    }
    
    return false;
}

/* -------------------------------------------------------------------------- */
/* Public Event Retrieval                                                     */
/* -------------------------------------------------------------------------- */
bool GCODE_GetNextEvent(GCODE_CommandQueue* cmdQueue, GCODE_Event* event)
{
    if (!cmdQueue || !event) return false;
    if (cmdQueue->count == 0) return false;

    GCODE_Command* gc = &cmdQueue->commands[cmdQueue->tail];
    if (gc->command[0] == '\0') {
        // Empty command - consume it and return false
        cmdQueue->tail = (cmdQueue->tail + 1) % GCODE_MAX_COMMANDS;
        cmdQueue->count--;
        return false;
    }

    if (!parse_command_to_event(gc->command, event)) {
        // Parse failed - consume command and return false
        DEBUG_PRINT_GCODE("[GetEvent] Parse failed for: '%s'\r\n", gc->command);
        cmdQueue->tail = (cmdQueue->tail + 1) % GCODE_MAX_COMMANDS;
        cmdQueue->count--;
        return false;
    }

    // ✅ SUCCESS: Event parsed, but DON'T consume yet!
    // Event will be consumed after successful processing via GCODE_ConsumeEvent()
    DEBUG_PRINT_GCODE("[GetEvent] Event ready: type=%d from cmd='%s'\r\n", event->type, gc->command);
    return true;
}

/**
 * @brief Consume the current event from the queue after successful processing
 * 
 * CRITICAL: Only call this AFTER successfully processing the event from GCODE_GetNextEvent!
 */
void GCODE_ConsumeEvent(GCODE_CommandQueue* cmdQueue)
{
    if (!cmdQueue) return;
    if (cmdQueue->count == 0) return;
    
    // Remove the event that was just processed
    cmdQueue->tail = (cmdQueue->tail + 1) % GCODE_MAX_COMMANDS;
    cmdQueue->count--;
}

/* -------------------------------------------------------------------------- */
/* Flow Control Helpers - Centralized OK Management                           */
/* -------------------------------------------------------------------------- */

/* Removed IsOkPending/SetOkPending/ClearOkPending helpers to avoid unused warnings;
   logic now accesses okPending directly inside the flow-control helpers below. */

/**
 * @brief Compute high-water mark for flow control (when to START deferring ok)
 * 
 * Returns maxSegments - HIGH_WATER threshold
 * Example: With MAX=16, HIGH_WATER=2 → defer when queue >= 14
 */
static inline uint32_t Flow_HighWater(const GCODE_CommandQueue* q)
{
    if (q == NULL) return 0U;
    return (q->maxMotionSegments > MOTION_BUFFER_HIGH_WATER)
         ? (uint32_t)(q->maxMotionSegments - MOTION_BUFFER_HIGH_WATER)
         : 0U;
}

/**
 * @brief Compute low-water mark for flow control (when to RESUME sending ok)
 * 
 * Returns maxSegments - LOW_WATER threshold
 * Example: With MAX=16, LOW_WATER=4 → resume when queue <= 12
 */
static inline uint32_t Flow_LowWater(const GCODE_CommandQueue* q)
{
    if (q == NULL) return 0U;
    return (q->maxMotionSegments > MOTION_BUFFER_LOW_WATER)
         ? (uint32_t)(q->maxMotionSegments - MOTION_BUFFER_LOW_WATER)
         : 0U;
}

/**
 * @brief Check if we should send a deferred "ok" response
 * 
 * With aggressive flow control, only send deferred "ok" when motion queue
 * is COMPLETELY empty. This ensures UGS doesn't see "Finished" until all
 * motion has executed.
 * 
 * @param appData Application data with motion queue count
 * @param q Command queue (unused with current logic)
 */
void GCODE_CheckDeferredOk(APP_DATA* appData, GCODE_CommandQueue* q) {
    uint32_t highWater = Flow_HighWater(&appData->gcodeCommandQueue); // MAX - 1 = 63
    uint32_t lowWater  = Flow_LowWater(&appData->gcodeCommandQueue);  // MAX - 1 = 63

    // Do NOT release deferred oks while a G4 dwell is in progress.
    // During the dwell the trajectory queue is empty (motionQueueCount=0) which
    // would normally trigger a flood of deferred oks.  UGS would then receive
    // oks for all remaining commands, conclude the file is done, and send a
    // soft-reset — discarding commands still sitting in the gcode command queue.
    if (MOTION_IsDwellActive()) {
        DEBUG_PRINT_GCODE("[FLOW] Dwell active — suppressing deferred ok release\r\n");
        return;
    }

    if (!startupPrefillDone) {
        // ── Pre-fill phase ────────────────────────────────────────────────────
        // Hold ALL "ok" responses until the trajectory queue is at high-water.
        // Once it crosses that line, flush every accumulated "ok" in one burst
        // and switch to normal 1-for-1 flow.
        if (appData->motionQueueCount >= highWater) {
            startupPrefillDone = true;
            DEBUG_PRINT_GCODE("[PREFILL] Queue reached high-water (%lu), flushing %lu deferred ok(s)\r\n",
                              (unsigned long)highWater, (unsigned long)okPendingCount);
            while (okPendingCount > 0) {
                if (UART_SendOK()) {
                    okPendingCount--;
                } else {
                    break; // TX buffer full, remainder released next iteration
                }
            }
        }
        // else: still filling — nothing to release yet
        return;
    }

    // ── Normal flow phase ─────────────────────────────────────────────────────
    // Release one "ok" per freed slot: as long as the queue is below high-water
    // (i.e. any slot is free) drain one pending ok at a time so UGS immediately
    // refills that slot and the queue stays near 63/64.
    while (okPendingCount > 0
           && appData->motionQueueCount < lowWater
           && q->count < GCODE_MAX_COMMANDS) {
        DEBUG_PRINT_GCODE("[DEFERRED] Sending deferred ok (queue=%lu < lowWater=%lu, pending=%lu)\r\n",
                          (unsigned long)appData->motionQueueCount, (unsigned long)lowWater,
                          (unsigned long)okPendingCount);
        if (UART_SendOK()) {
            okPendingCount--;
        } else {
            break;  // TX buffer full, try again next iteration
        }
    }
}

/**
 * @brief Decide whether to send "ok" immediately or defer it
 * 
 * Called when a command is received.
 * Uses HIGH_WATER threshold - defers ok when buffer is almost full.
 * 
 * @param currentQueueCount Current motion queue count
 * @param maxSegments Maximum motion queue size
 */
static void SendOrDeferOk(APP_DATA* appData, GCODE_CommandQueue* q)
{
    uint32_t highWater = Flow_HighWater(q); // MAX - 1 = 63

    // While a G4 dwell is active, always defer — never send immediately.
    // The trajectory queue is empty during the dwell (motionQueueCount=0) so
    // without this guard every new incoming command would get an instant ok,
    // letting UGS exhaust its credit window and declare the file complete
    // before the queued commands have actually executed.
    if (MOTION_IsDwellActive()) {
        DEBUG_PRINT_GCODE("[FLOW] Dwell active — deferring ok\r\n");
        okPendingCount++;
        return;
    }

    if (!startupPrefillDone) {
        // Pre-fill phase: send immediately so UGS keeps pushing commands
        // and the trajectory queue fills toward high-water as fast as possible.
        DEBUG_PRINT_GCODE("[PREFILL] Sending immediate ok (queue=%lu, filling to highWater=%lu)\r\n",
                          (unsigned long)appData->motionQueueCount,
                          (unsigned long)highWater);
        (void)UART_SendOK();
        return;
    }

    // Normal 1-for-1 phase: defer when trajectory queue is at high-water OR the gcode
    // command queue is full (prevents silent command drops in pipelined senders like UGS).
    bool cmdQueueFull = (q->count >= GCODE_MAX_COMMANDS);
    if (appData->motionQueueCount >= highWater || cmdQueueFull) {
        DEBUG_PRINT_GCODE("[FLOW] Deferring ok (queue=%lu >= highWater=%lu, pending=%lu)\r\n",
                          (unsigned long)appData->motionQueueCount,
                          (unsigned long)highWater,
                          (unsigned long)(okPendingCount + 1));
        okPendingCount++;
    } else {
        DEBUG_PRINT_GCODE("[FLOW] Sending immediate ok (queue=%lu < highWater=%lu)\r\n",
                          (unsigned long)appData->motionQueueCount,
                          (unsigned long)highWater);
        (void)UART_SendOK();
    }
}

